INSERT Customers
(FirstName, MiddleName, LastName, [Address], City, Phone)
VALUES
('Василий', 'Анатольевич', 'Шевченко', 'Забелина 25а, 137','Москва','89268089574'),
('Геннадий', 'Сергеевич', 'Шишкин', 'Абызова  15','Кемерово','89069328592'),
('Сергей', 'Анатольевич', 'Белов', 'Забелина 25а, 137','Москва','89087469814'),
('Оксана', 'Михайловна', 'Осина', 'Заветная 11, 54','Москва','89268248711'),
('Кирилл', 'Валерьевич', 'Котов', 'Свободы 20а, 16','Кемерово','89069327333'),
('Cветлана', 'Сергеевна', 'Сизова', 'Вершовская 28','Новосибирск','89089742587'),
('Иван', 'Юрьевич', 'Седаков', 'Балтийская 23б, 69','Кемерово','89236028416'),
('Галина', 'Михайловна', 'Сонина', 'Алтайская 14','Кемерово','89238879574'),
('Иван', 'Сергеевич', 'Иванов', 'Военная 37, 84','Новосибирск','89087159531'),
('Анатолий', 'Николаевич', 'Котов', 'Антипова 84, 13','Кемерово','89069345872');

INSERT Employees
(FirstName, MiddleName, LastName, Position, Salary, PriorSalary, Phone)
VALUES
('Анатолий', 'Владимирович', 'Маслов', 'Главный директор', 50000, 8000, '89089300541'),
('Андрей', 'Антонович', 'Городецкий', 'Менеджер', 20000, 3000, '89235168794'),
('Олег', 'Артемович', 'Сурков', 'Менеджер по продажам', 17000, 2000, '89069347825'),
('Максим', 'Иванович', 'Рудаков', 'Менеджер по продажам', 17000, 2000, '89235486258'),
('Ирина', 'Михайловна', 'Зубова', 'Менеджер', 20000, 3000, '89089300581'),
('Мария', 'Вадимовна', 'Карпова', 'Менеджер по продажам', 17000, 2000, '89069328514');

INSERT ProductCategory
([Name])
VALUES
('Ноутбуки'),
('Смартфоны'),
('Телевизоры');


INSERT Products
(CategoryID, [Name], Color, [Description])
VALUES
(1, 'Ноутбук Lenovo B5045', 'Черный', 'Экран: 15.6" (1366x768) матовый / Процессор: двухъядерный AMD E1 6010 (1.35 ГГц)'),
(1, 'Ноутбук Acer Extensa EX2530-C1FJ', 'Черный', 'Экран: 15.6" (1366x768) матовый / Процессор: двухъядерный Intel Celeron 2957U (1.4 ГГц)) / Оперативная память: 2 ГБ / Жесткий диск: 500ГБ'),
(1, 'Ноутбук DELL Inspiron 3162-0538', 'Белый', 'Экран: 11.6" (1366x768) матовый / Процессор: двухъядерный Intel Celeron N3050 (1.6 ГГц) / Оперативная память: 4 ГБ / Жесткий диск: 1 ТБ'),
(1, 'Нетбук Prestigio Smartbook 133S', 'Коричневый', 'Экран: 13.3" (1920x1080) глянцевый / Процессор: двуххъядерный Intel Celeron N3350 (2.4 ГГц) / Оперативная память: 3 ГБ / Жесткий диск: 32 ГБ'),
(1, 'Нетбук Acer Spin 1 SP111-32N-P25R', 'Серый', 'Экран: 11.6" (1920x1080) матовый / Процессор: четырехъядерный Intel Pentium N4200 (1.8 ГГц) / Оперативная память: 4 ГБ / Жесткий диск: 64 ГБ'),
(1, 'Ультрабук Irbis NB99', 'Серебристый', 'Экран: 13.3" (1920x1080) глянцевый / Процессор: двухъядерный Intel Core M3 6Y30 (2.2 ГГц) / Оперативная память: 8 ГБ / Жесткий диск: 240 ГБ'),
(2, 'Смартфон Samsung Galaxy S6 SM-G920F 32GB', 'Черный', 'Экран: 5.1" (2560x1440) / Процессор: восьмиядерный Samsung Exynos 7420 / Оперативная память: 3 ГБ / Фотокамера: 16 Мп'),
(2, 'Смартфон Apple iPhone 7 32GB', 'Черный', 'Экран: 4.7" (1334x750) / Процессор: четырехъядерный Apple A10 Fusion / Оперативная память: 2 ГБ / Фотокамера: 12 Мп'),
(3, 'Телевизор Samsung UE32M5500', 'Черный', 'Экран: 32" (1920х1080) / Wi-Fi, Ethernet,Bluetooth, HDMI х 3, USB х 2'),
(3, 'Телевизор LG 49LH541V', 'Серебристый', 'Экран: 49" (1920х1080) / Мощность звука: 10 Вт / Цифровые тюнеры: DVB-C, DVB-S2, DVB-T2 / Максимальная потребляемая мощность: 41 Вт');

INSERT Orders
(CustomerID, EmployeeID, ProductID, Quantity, Price, OrderDate)
VALUES
(1,3,1,1, 15500, DATEADD(DAY, -85, GETDATE())),
(2,6,2,1, 18950, DATEADD(DAY, -85, GETDATE())),
(3,4,6,1, 21000, DATEADD(DAY, -85, GETDATE())),
(3,4,4,1, 17650, DATEADD(DAY, -75, GETDATE())),
(2,3,9,4, 49990, DATEADD(DAY, -65, GETDATE())),
(4,6,7,1, 21500, DATEADD(DAY, -65, GETDATE())),
(1,3,1,1, 15550, DATEADD(DAY, -55, GETDATE())),
(5,4,8,1, 28550, DATEADD(DAY, -45, GETDATE())),
(6,3,8,2, 56000, DATEADD(DAY, -45, GETDATE())),
(1,4,9,1, 17250, DATEADD(DAY, -45, GETDATE())),
(2,4,6,1, 19950, DATEADD(DAY, -45, GETDATE())),
(7,3,10,1, 38900, DATEADD(DAY, -35, GETDATE())),
(6,4,7,3, 57990, DATEADD(DAY, -35, GETDATE())),
(3,4,7,2, 44990, DATEADD(DAY, -35, GETDATE())),
(5,6,9,1, 11780, DATEADD(DAY, -35, GETDATE())),
(8,4,8,2, 41000, DATEADD(DAY, -25, GETDATE())),
(5,4,5,2, 38650, DATEADD(DAY, -25, GETDATE())),
(7,3,4,1, 19450, DATEADD(DAY, -15, GETDATE())),
(9,3,5,1, 27850, DATEADD(DAY, -15, GETDATE())),
(8,4,1,1, 15500, DATEADD(DAY, -15, GETDATE())),
(10,4,2,1, 19500, DATEADD(DAY, -15, GETDATE())),
(10,3,1,3, 45450, DATEADD(DAY, -5, GETDATE())),
(10,4,2,1, 17860, DATEADD(DAY, -5, GETDATE()));